# DisplacementPathStyle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DisplacementPathStyle Property
ParameterTypeId Class See Also
---
"Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DisplacementPathStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisplacementPathStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DisplacementPathStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace